#include <stdio.h>

int main(){
    int a = 5;
    int b = 17;
    int c = 9; // แก้ไขตัวแปรจาก float c = 8.5 เป็น int = 9 เนื่องจากตัวแปรนี้ต้องใช้ดำเนินการ % และการดำเนินการนี้ต้องใช้ตัวแปรชนิด int เท่านั้น
    int d = 4; // แก้ไขตัวแปรจาก float d = 4.0 เป็น int d = 4  เนื่องจากตัวแปรนี้ต้องใช้ดำเนินการ % และการดำเนินการนี้ต้องใช้ตัวแปรชนิด int เท่านั้น

    printf("a = %d, b = %d, c = %d, d = %d\n", a, b, c, d);
    printf("d+a = %d\n", d + a);
    printf("a-b = %d\n", a - b);
    printf("c*d = %d\n", c * d);
    printf("a*c = %d\n", a * c);
    printf("c/d = %d\n", c / d);
    printf("b/c = %d\n", b / c);
    printf("a mod b = %d\n", a % b);
    printf("c mod a = %d\n", c % a); // ก่อนแก้ไขเกิดการ error เนื่องจากก่อนทำการปรับแก้ไข ชนิดตัวแปรคือ float ซึ่งไม่สามารถใช้ % ได้ เลยทำการปรับแก้ชนิดตัวแปรเป็น int โปรแกรมจึงสามารถดำเนินการได้ปกติ
    printf("c mod d = %d\n", c % d); // ก่อนแก้ไขเกิดการ error เนื่องจากก่อนทำการปรับแก้ไข ชนิดตัวแปรคือ float ซึ่งไม่สามารถใช้ % ได้ เลยทำการปรับแก้ชนิดตัวแปรเป็น int โปรแกรมจึงสามารถดำเนินการได้ปกติ

    return 0;
}

/*
บรรทัดที่ 1 ประกาศเรียกใช้ stdio.h
บรรทัดที่ 3 กำหนดฟังก์ชัน main
บรรทัดที่ 4 กำหนดค่าตัวแปร a = 5
บรรทัดที่ 5 กำหนดค่าตัวแปร b = 17
บรรทัดที่ 6 กำหนดค่าตัวแปร c = 9 โดยบรรทัดนี้ได้มีการปรับแก้ค่าตัวแปรจาก 8.5 เป็น 9 เพื่อปรับชนิดตัวแปรจาก float เป็น int
          เพื่อให้สามารถใช้ตัวดำเนินการ % เพื่อหาเศษได้ เนื่องจากตัวดำเนินการ % บังคับให้ชนิดตัวแปรเป็น int เท่านั้น
บรรทัดที่ 7 กำหนดค่าตัวแปร d = 4 โดยบรรทัดนี้ได้มีการปรับแก้ค่าตัวแปรจาก 4.0 เป็น 4 เพื่อปรับชนิดตัวแปรจาก float เป็น int
          เพื่อให้สามารถใช้ตัวดำเนินการ % เพื่อหาเศษได้ เนื่องจากตัวดำเนินการ % บังคับให้ชนิดตัวแปรเป็น int เท่านั้น
บรรทัดที่ 9 แสดงผลลัพธ์ค่าเริ่มต้นตัวแปรทั้งหมด a = %d, b = %d, c = %d, d = %d เลือกใช้ format code %d 
          เพราะต้องการให้แสดงผลเป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่ โดยเรียกค่าตัวแปรจาก a, b, c, d ตามลำดับ
บรรทัดที่ 10 แสดงผลลัพธ์ d+a = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่
          โดยใช้ตัวดำเนินการ + กำหนดนิพจน์ d + a เพื่อแสดงผลลัพธ์
บรรทัดที่ 11 แสดงผลลัพธ์ a-b = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่
          โดยใช้ตัวดำเนินการ - กำหนดนิพจน์ a - b เพื่อแสดงผลลัพธ์
บรรทัดที่ 12 แสดงผลลัพธ์ c*d = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่
          โดยใช้ตัวดำเนินการ * กำหนดนิพจน์ c * d เพื่อแสดงผลลัพธ์
บรรทัดที่ 13 แสดงผลลัพธ์ a*c = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่
          โดยใช้ตัวดำเนินการ * กำหนดนิพจน์ a * c เพื่อแสดงผลลัพธ์
บรรทัดที่ 14 แสดงผลลัพธ์ c/d = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่
          โดยใช้ตัวดำเนินการ / กำหนดนิพจน์ c / d เพื่อแสดงผลลัพธ์
บรรทัดที่ 15 แสดงผลลัพธ์ b/c = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็ม \n เพราะต้องการให้ขึ้นบรรทัดใหม่
          โดยใช้ตัวดำเนินการ / กำหนดนิพจน์ b / c เพื่อแสดงผลลัพธ์
บรรทัดที่ 16 แสดงผลลัพธ์ a mod b = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็มและการดำเนินการนี้บังคับให้ชนิดตัวแปรเป็น int
          \n เพราะต้องการให้ขึ้นบรรทัดใหม่ โดยใช้ตัวดำเนินการ % กำหนดนิพจน์ a % b เพื่อแสดงผลลัพธ์
บรรทัดที่ 17 แสดงผลลัพธ์ c mod a = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็มและการดำเนินการนี้บังคับให้ชนิดตัวแปรเป็น int
          \n เพราะต้องการให้ขึ้นบรรทัดใหม่ โดยใช้ตัวดำเนินการ % กำหนดนิพจน์ c % a เพื่อแสดงผลลัพธ์
บรรทัดที่ 18 แสดงผลลัพธ์ c mod a = %d เลือกใช้ format code %d เพราะต้องการให้แสดงผลลัพธ์เป็นจำนวนเต็มและการดำเนินการนี้บังคับให้ชนิดตัวแปรเป็น int
          \n เพราะต้องการให้ขึ้นบรรทัดใหม่ โดยใช้ตัวดำเนินการ % กำหนดนิพจน์ c % d เพื่อแสดงผลลัพธ์
บรรทัดที่ 20 คืนค่าเป็น 0

    ผลจากจากการทดลอง ในตอนแรกได้ประกาศตัวแปร float c = 8.5 และ float d = 4.0 ซึ่งทำให้โปรแกรมเกิดการ error เนื่องจากการดำเนินการ %
บังคับให้ดำเนินการระหว่างชนิดตัวแปร int เท่านั้น จึงทำการปรับแก้เป็น float c = 9 และ float d = 4 จึงสามารถดำเนินการได้ปกติ
*/