#include <stdio.h>

int main(){
    double x=1.0, y=2.0, z=0.0;
    printf("--------+---------+---------\n");
    printf("   x    |    y    |    z    \n");
    printf("--------+---------+---------\n");
    printf("%8.1f| %8.1f| %8.1f\n", x, y, z);
    printf("%8.1f| %8.1f| %8.1f\n", x=y+5.0, y, z);
    printf("%8.1f| %8.1f| %8.1f\n", x, y=x/2.0, z);
    printf("%8.1f| %8.1f| %8.1f\n", x, y=(x*3.0)+4.0, z);
    printf("%8.1f| %8.1f| %8.1f\n", x=-0.5-y, y, z);
    printf("%8.1f| %8.1f| %8.1f\n", x, y, z=x+y);    

    return 0;
}

/*

บรรทัดที่ 1 ประกาศเรียกใช้ stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main
บรรทัดที่ 4 กำหนด double x=1.0, y=2.0, z=0.0
บรรทัดที่ 5 แสดงผล --------+---------+--------- ขึ้นบรรทัดใหม่
บรรทัดที่ 6 แสดงผล    x    |    y    |    z     ขึ้นบรรทัดใหม่
บรรทัดที่ 7 แสดงผล --------+---------+--------- ขึ้นบรรทัดใหม่
บรรทัดที่ 8 แสดงผล x, y, z ตามฟอร์มที่กำหนดคือ %8.1f| %8.1f| %8.1f แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นทศนิยม 1 ตำแหน่ง แล้วขึ้นบรรทัดใหม่
บรรทัดที่ 9 แสดงผล x=y+5.0, y, z ตามฟอร์มที่กำหนดคือ %8.1f| %8.1f| %8.1f แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นทศนิยม 1 ตำแหน่ง แล้วขึ้นบรรทัดใหม่
บรรทัดที่ 10 แสดงผล x, y=x/2.0, z ตามฟอร์มที่กำหนดคือ %8.1f| %8.1f| %8.1f แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นทศนิยม 1 ตำแหน่ง แล้วขึ้นบรรทัดใหม่
บรรทัดที่ 11 แสดงผล x, y=(x*3.0)+4.0, z ตามฟอร์มที่กำหนดคือ %8.1f| %8.1f| %8.1f แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นทศนิยม 1 ตำแหน่ง แล้วขึ้นบรรทัดใหม่
บรรทัดที่ 12 แสดงผล x=-0.5-y, y, z ตามฟอร์มที่กำหนดคือ %8.1f| %8.1f| %8.1f แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นทศนิยม 1 ตำแหน่ง แล้วขึ้นบรรทัดใหม่
บรรทัดที่ 13 แสดงผล x, y, z=x+y ตามฟอร์มที่กำหนดคือ %8.1f| %8.1f| %8.1f แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นทศนิยม 1 ตำแหน่ง แล้วขึ้นบรรทัดใหม่
บรรทัดที่ 15 คืนค่าเป็น 0

*/