#include <stdio.h>

int main(){
    int x = 12, y = 7, z = 12;

    printf("x>y : %d\n", x>y);
    printf("x<z : %d\n", x<z);
    printf("x==z : %d\n", x==z);
    printf("x!=y : %d\n", x!=y);
    printf("!(2*5>=y)||(5!=(5/3)) : %d\n", !(2*5>=y)||(5!=(5/3)));
    printf("!(x<y) : %d\n", !(x<y));
    printf("(x+y)>(z*2) : %d\n", (x+y)>(z*2));
    printf("(x mod 2==0)||(y mod 2==1) : %d\n", (x%2==0)||(y%2==1));
    printf("(x>y)&&(z<y) : %d\n", (x>y)&&(z<y));

    return 0;
}

/*

บรรทัดที่ 1 เรียกใช้ stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main
บรรทัดที่ 4 กำหนดค่า x=12, y=7, z=12 โดยกำหนดเป็นจำนวนจริง
บรรทัดที่ 6 แสดงผลตามเงื่อนไข x>y โดยมีผลเป็นจริง
บรรทัดที่ 7 แสดงผลตามเงื่อนไข x<z โดยมีผลเป็นเท็จจริง
บรรทัดที่ 8 แสดงผลตามเงื่อนไข x==z โดยมีผลเป็นจริง
บรรทัดที่ 9 แสดงผลตามเงื่อนไข x!=y โดยมีผลเป็นจริง
บรรทัดที่ 10 แสดงผลตามเงื่อนไข !(2*5>=y)||(5!=(5/3)) โดยมีผลเป็นจริง
บรรทัดที่ 11 แสดงผลตามเงื่อนไข !(x<y) โดยมีผลเป็นจริง
บรรทัดที่ 12 แสดงผลตามเงื่อนไข (x+y)>(z*2) โดยมีผลเป็นเท็จ
บรรทัดที่ 13 แสดงผลตามเงื่อนไข (x%2==0)||(y%2==1) โดยมีผลเป็นจริง
บรรทัดที่ 14 แสดงผลตามเงื่อนไข (x>y)&&(z<y) โดยมีผลเป็นเท็จ
บรรทัดที่ 16 คืนค่าเป็น 0

*/