#include <stdio.h>

int main(){
    int i = 1, j = 2, k=0;
    printf("--------+---------+---------\n");
    printf("   i    |    j    |    k    \n");
    printf("--------+---------+---------\n");
    printf("%8d| %8d| %8d\n", i, j, k);
    printf("%8d| %8d| %8d\n", i, j, k=i+j);
    printf("%8d| %8d| %8d\n", i=i+(k*j), j, k);
    printf("%8d| %8d| %8d\n", i, j=i/2, k);
    printf("%8d| %8d| %8d\n", i, j, k=i%2);
    printf("%8d| %8d| %8d\n", i=(j+k)*3, j, k);    

    return 0;
}

/*

บรรทัดที่ 1 ประกาศเรียกใช้ stdio.h 
บรรทัดที่ 3 ประกาศฟังก์ชัน main
บรรทัดที่ 4 กำหนดค่า i = 1, j = 2, k = 0
บรรทัดที่ 5 แสดงผล --------+---------+--------- และขึ้นบรรทัดใหม่
บรรทัดที่ 6 แสดงผล    i    |    j    |    k     และขึ้นบรรทัดใหม่
บรรทัดที่ 7 แสดงผล --------+---------+--------- และขึ้นบรรทัดใหม่
บรรทัดที่ 8 แสดงผล ค่า i, j, k ตามฟอร์มที่กำหนดคือ %8d| %8d| %8d แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นจำนวนเต็ม และขึ้นบรรทัดใหม่
บรรทัดที่ 9 แสดงผล ค่า i, j, k=i+j ตามฟอร์มที่กำหนดคือ %8d| %8d| %8d แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นจำนวนเต็ม และขึ้นบรรทัดใหม่
บรรทัดที่ 10 แสดงผล ค่า i=i+(k*j), j, k ตามฟอร์มที่กำหนดคือ %8d| %8d| %8d แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นจำนวนเต็ม และขึ้นบรรทัดใหม่
บรรทัดที่ 11 แสดงผล ค่า i, j=i/2, k ตามฟอร์มที่กำหนดคือ %8d| %8d| %8d แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นจำนวนเต็ม และขึ้นบรรทัดใหม่
บรรทัดที่ 12 แสดงผล ค่า i, j, k=i%2 ตามฟอร์มที่กำหนดคือ %8d| %8d| %8d แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นจำนวนเต็ม และขึ้นบรรทัดใหม่
บรรทัดที่ 13 แสดงผล ค่า i=(j+k)*3, j, k ตามฟอร์มที่กำหนดคือ %8d| %8d| %8d แปลได้ว่ากำหนดพื้นที่ 8 ช่องแสดงผลเป็นจำนวนเต็ม และขึ้นบรรทัดใหม่
บรรทัดที่ 15 คืนค่าเป็น 0

*/