#include<stdio.h>

int main(){
    float a = 5.0, b = 2.0, x = 3.0, y = 4.5;
    int r1 = a++*b+(int)y%3;
    int r2 = (a>b)&&((int)x/b<2);
    float r3 = ++x*y-a/2;
    float r4 = ((x+=1.5)>y)||(b-->0);

    printf("r1 = %d\n", r1);
    printf("r2 = %d\n", r2);
    printf("r3 = %.2f\n", r3);
    printf("r4 = %.2f\n", r4);

    return 0;
}

/*

บรรทัดที่ 1 เรียกใช้ stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main
บรรทัดที่ 4 กำหนดตัวแปร float a = 5.0, b = 2.0, x = 3.0, y = 4.5
บรรทัดที่ 5 กำหนดตัวแปร int r1 = a++*b+(int)y%3
บรรทัดที่ 6 กำหนดตัวแปร int r2 = (a>b)&&((int)x/b<2)
บรรทัดที่ 7 กำหนดตัวแปร float r3 = ++x*y-a/2
บรรทัดที่ 8 กำหนดตัวแปร float r4 = ((x+=1.5)>y)||(b-->0)
บรรทัดที่ 10 แสดงผล r1 = r1
บรรทัดที่ 11 แสดงผล r2 = r2
บรรทัดที่ 12 แสดงผล r3 = r3
บรรทัดที่ 13 แสดงผล r4 = r4
บรรทัดที่ 15 คืนค่าเป็น 0

*/