#include<stdio.h>

int main(){
    printf("A = %d\n", -2+5*2);
    printf("B = %d\n", 10/2*3);
    printf("C = %d\n", 6/2+3*(4%2));
    printf("D = %d\n", (5+2)*15%4);
    printf("E = %d\n", 6+2*2-6/2);
    printf("F = %d\n", 5+3*2-8/4+(6%5));
    printf("G = %d\n", (4+3)*2-10/(2+3));
    return 0;
}

/*

บรรทัดที่ 1 เรียกใช้ stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main
บรรทัดที่ 4 แสดงผลค่า A =  ตามนิพจน์ -2+5*2 โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 5 แสดงผลค่า B = ตามนิพจน์ 10/2*3 โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 6 แสดงผลค่า C = ตามนิพจน์ 6/2+3*(4%2) โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 7 แสดงผลค่า D = ตามนิพจน์ (5+2)*15%4 โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 8 แสดงผลค่า E = ตามนิพจน์ 6+2*2-6/2 โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 9 แสดงผลค่า F = ตามนิพจน์ 5+3*2-8/4+(6%5) โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 10 แสดงผลค่า G = ตามนิพจน์ (4+3)*2-10/(2+3) โดยมีผลเป็น แล้วขึ้นบรรทัดใหม่ ซึ่งผลที่แสดงจะเป็นจำนวนจริง
บรรทัดที่ 11 คืนค่าเป็น 0

*/